In [1]:
import pandas as pd

In [5]:
data = pd.read_csv("C:\\Users\\TOHED\\Desktop\\day1.txt", header=None)

In [6]:
data.head()

      0
0  1619
1  1919
2  1441
3  1861
4  1932

In [9]:
data.rename(columns = {0:'num'}, inplace=True)

In [10]:
data.head()

    num
0  1619
1  1919
2  1441
3  1861
4  1932

In [12]:
for i in data.num:
    for j in data.num:
        for k in data.num:
            if i+j+k == 2020:
                print(i ,j, k , i*j*k)

390 324 1306 165026160
390 1306 324 165026160
324 390 1306 165026160
324 1306 390 165026160
1306 390 324 165026160
1306 324 390 165026160